IdeaRS.OpenModel.Model.Member1DType
Type of Member 1D

IdeaRS.OpenModel.Model.Member1DType.Beam
Beam member

IdeaRS.OpenModel.Model.Member1DType.Column
Column member

IdeaRS.OpenModel.Model.Member1DType.Truss
Truss member

IdeaRS.OpenModel.Model.Member1DType.Rib
Rib member

IdeaRS.OpenModel.Model.Member1DType.BeamSlab
Beam slab, rcs element